"""
2.  При обробці тексту часто потрібно «почистити» текст перед тим, як робити з ним
якісь інші дії. Наприклад, якщо ви хочете підрахувати кількість входжень слів в тексті,
для спрощення завдання перед початком підрахунку можна подбати про те, щоб весь текст
був записаний в нижньому регістрі (або у верхньому) і з нього були вилучені всі знаки пунктуації.
Також можна розбити текст на послідовності слів. Виконайте таку нормалізацію тексту
на прикладі тексту з першої частини першого розділу книги «Дон Кіхот» Мігеля де Сервантеса
Сааведри, який можна звантажити із проекту gutenberg.org. Для виконання завдання, спочатку
завантажте текстовий файл, що містить текст книги, далі скопіюйте із завантаженого файлу
перший розділ у новий файл з назвою quixote.txt. Прочитайте дані із текстового файлу quixote.txt і
потурбуйтеся про те, щоб всі символи були приведені до одного регістру, видаліть всі знаки
пунктуації і запишіть слова по одному на рядок у інший текстовий файл з ім’ям quixote_clean.txt.
Вхідні дані:
Вхідний файл quixote.txt з початковим текстом
Вихідні дані:
Вихідний файл quixote_clean.txt з нормалізованим текстом


Автор: Шарабар Ярослав Анатолійович

"""
def func(quixote, quixote__clean):
    with open("quixote.txt", "r") as file:
        text = file.read()

    text = text.lower()
    symbol = "!?,.-"
    for del_s in symbol:
        text = text.replace(del_s, '')
    words = text.split()
    

    with open("quixote_clean.txt", "w") as ending_file:
        for word in words:
            ending_file.write(word + '\n')

quixote = 'quixote.txt'
quixote__clean = 'quixote_clean.txt'
func(quixote, quixote__clean)
print("Ваш текст оброблений")
              
    
